Repository: NicolayAdamchuk/SketchReinforcement
Catalog: SketchReinforcement/Resourses/Strings/Texts.*.resx
Languages: ru

# Info1
source: Incorrect system rebar families. Use the form of rebars of the 2016 version.
ru: Неподходящее системное семейство ФОРМА СТЕРЖНЯ. Используйте формы стержней из версии 2016.

# Info2
source: Save the file before execute the command
ru: Сохраните файл до выполнения команды.

# NameImage
source: Reinforcement sketch
ru: Эскизы арматуры

# NamePanel
source: Reinforcement: tools
ru: Арматура: инструменты

# pathToHelp
source: \\Resources\\Help\\Sketch reinforcement.chm
ru: \\Resources\\Help\\Sketch reinforcement_ru.chm

# Title1
source: problem
ru: проблема

# NameTransaction
source: Reinforcement sketch
ru: Эскизы арматуры

# RadioSelectAll
source: Create sketch for all rebars
ru: Создать эскизы для всех стержней

# RadioSelectSingle
source: Create sketch for some rebars
ru: Создать эскизы для выбранных стержней

# RadiusBending
source: Draw bending radius
ru: Показать радиусы загиба

# UpdateManual
source: Update manual correction
ru: Обновить ручные исправления

# SelectRebar
source: Select single rebar
ru: Выберите отдельный стержень

source: Default
ru: По умолчанию

# Radius
source: Draw bending radius
ru: Показать радиусы загиба

# TitleFormPreview
source: Preview sketch
ru: Просмотр эскиза

source: Cancel
ru: Отмена

# HSketch
source: Sketсh height
ru: Высота эскиза

# HooksVisible
source: Show hooks length
ru: Показать длину крюков

# ByView
source: Create sketch for rebars of current view
ru: Создать эскизы для стержней текущего вида

# ByPartition
source: Create sketch for some partition
ru: Создать эскизы для выбранного раздела

# Folder
source: The project file is in a protected folder. Impossible to create a folder to place sketches.
ru: Файл проекта находится в защищенной папке. Невозможно создать папку для размещения эскизов.

# DeleteSketch
source: Remove ALL pictures
ru: Удалить ВСЕ рисунки

# NameTransaction1
source: Remove sketch
ru: Удаление эскизов

# ByAxis
source: Dimensions by axes
ru: Размеры по осям

# ShowAngle
source: Show bend angle
ru: Показать угол загиба

# LabelFont
source: Font
ru: Шрифт

# MaxLength
source: Maximum length
ru: Максимальная длина

source: Overlap
ru: Нахлест

# GroupBox2
source: For standard shapes only
ru: Для стандартных форм

# ShowDimLines
source: Show dimension lines
ru: Показать размерные линии

# PathToHelpFile
source: c:\\ProgramData\\Autodesk\\ApplicationPlugins\\ADNPlugin-SketchReinforcement.bundle\\Contents\\Resources\\Help\\Sketch reinforcement.chm
ru: c:\\ProgramData\\Autodesk\\ApplicationPlugins\\ADNPlugin-SketchReinforcement.bundle\\Contents\\Resources\\Help\\Sketch reinforcement_ru.chm

# HelpSection
source: runningadd-inanditsresults.htm
ru: newtopic1.htm

# TabControl1
source: Standard shape
ru: Стандартные формы

# TabControl2
source: Project shape
ru: Проектные формы

# VersionNumber
source: Add-in is for version not older then 2023
ru: Приложение предназначено для версии не старше 2023

# ShiftFromLine
source: Offset from line
ru: Смещение от линии

# ButtonFolder
source: Folder selection
ru: Выбор папки

# CheckFolder
source: Default
ru: По умолчанию

# GroupFolder
source: Sketching folder
ru: Папка для эскизов

# Border
source: External border
ru: Внешняя граница

source: Color
ru: Цвет

source: Select all
ru: Выбрать все

# NameTransaction2
source: Create sketch for tag
ru: Создание эскизов для марок

# Warning2
source: No family found for creating sketches-tags. Creating sketches for this project is not possible. Send a request to the developers (office@ar-cadia.com.ua) to solve the problem.
ru: Не найдены семейства для создания эскизов-аннотаций. Создание эскизов для данного проекта невозможно. Отправьте запрос разработчикам (office@ar-cadia.com.ua) для решения проблемы.

# Warning3
source: No suitable tags for sketching reinforcement or no need for changes. Or not the right active view.
ru: Нет подходящих аннотаций для размещения эскизов арматуры или нет необходимости в изменениях. Или не подходящий активный вид.

# WorkProcess1
source: Performs processing of existing tags...
ru: Выполняем обработку существующих аннотаций...

# SelectTags
source: Select reinforcement tags
ru: Выберите марки арматуры

# Warning1
source: Warning
ru: Предупреждение

# WorkProcess2
source: Performs processing of views...
ru: Выполняем обработку видов...

# BackGroundColor
source: Transparent background
ru: Прозрачный фон
